
### TAPS ############################################################
## brew tap [repo]

tap "beeftornado/rmtree"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
#tap "homebrew/cask-versions"
## homebrew/cask-versions contains alternate versions of Casks (e.g. betas, nightly releases, old versions)
tap "homebrew/core"
#tap "homebrew/services"
#tap "neovim/neovim"
tap "osx-cross/avr"
#tap "github/bootstrap"
#tap "github/packages"

### FORMULAE ########################################################
## brew install [formula]

brew "ack"
#brew "arduino-cli"
brew "avrdude"
brew "bash-completion"
brew "sqlite"
brew "cataclysm"
brew "cmake"
brew "git"
brew "gnu-chess"
brew "gnu-go"
brew "gnu-units"
#brew "go"
brew "imagemagick"
brew "markdown"
#brew "minicom"
brew "ncdu"
brew "nethack"
brew "node"
#brew "picocom"
brew "pngcrush"
brew "ruby-build"
brew "rbenv"
#brew "squashfs"
brew "telnet"
brew "tree"
#brew "tvnamer"
#brew "unrar"
brew "webkit2png"
brew "wget"

brew "heroku/brew/heroku"
brew "osx-cross/avr/avr-binutils"
brew "osx-cross/avr/avr-gcc"

### CASKS ###########################################################
## brew install --cask [package]
## More info: https://github.com/Homebrew/homebrew-cask/blob/master/USAGE.md

## specify a directory to install to
cask_args appdir: '/Applications'

cask "android-platform-tools"
cask "freecad"
cask "macvim"
## I'm installing macvim as a cask because I had compile issues a few times when using a formula install and this is NOT a program I want to sometimes not work!

## There's also Mac App Store installation possible, but I haven't set that up yet.


